Repository: nul1type/MacRAR
Catalog: MacRAR/*.lproj/Localizable.strings
Languages: ru

# select_rar
source: Select RAR File
ru: Выберите файл RAR

source: Extract Selected
ru: Извлечь выбранное

source: Extract All
ru: Извлечь все

source: Choose Folder
ru: Выберите папку

source: Extract Here
ru: Извлечь сюда

# status_select
source: Select a RAR archive
ru: Выберите архив RAR

# status_files
source: %d files in archive
ru: %d файлов в архиве

# status_extracting
source: Extracting files...
ru: Извлечение файлов...

# status_done
source: Extraction complete
ru: Извлечение завершено

# status_error
source: Error
ru: Ошибка

source: Cancel
ru: Отмена

source: Search
ru: Поиск

# no_files
source: No files in archive
ru: Нет файлов в архиве

# error_unrar
source: unrar utility not found
ru: Утилита unrar не найдена

# error_extraction
source: Extraction failed
ru: Извлечение не удалось

# error_dir
source: Directory error
ru: Ошибка каталога

# access_request_title
source: Access to file required
ru: Требуется доступ к файлу

# access_request_message
source: To work with the archive, grant access in the system dialog
ru: Для работы с архивом предоставьте доступ в системном диалоге

# access_request_button
source: Grant Access
ru: Предоставить доступ

source: Create Archive
ru: Создать архив

source: Select RAR Binary
ru: Выбрать RAR

# need_rar_binary
source: RAR utility not found. To create archives, please select the RAR binary.
ru: Утилита RAR не найдена. Для создания архивов укажите путь к RAR.

source: Copy Status
ru: Копировать статус

# create_archive_title
source: Create New Archive
ru: Создание нового архива

source: Archive Name
ru: Имя архива

source: New Archive
ru: Новый архив

source: Add Files
ru: Добавить файлы

source: Add Folder
ru: Добавить папку

source: Clear
ru: Очистить

# drop_files_here
source: Drop files here or click the buttons above
ru: Перетащите файлы сюда или нажмите кнопки выше

source: Copied to clipboard
ru: Скопировано в буфер обмена

source: File selection error: %@
ru: Ошибка выбора файла: %@

# files_added
source: Added %d files
ru: Добавлено %d файлов

source: Select Files
ru: Выбрать файлы

source: Add
ru: Добавить

source: Select Folder
ru: Выбрать папку

# access_denied
source: Access to the file was denied
ru: Доступ к файлу не предоставлен

source: Select All
ru: Выбрать все

source: Deselect All
ru: Снять выделение

# temporary_access_failed
source: Failed to get temporary access to file
ru: Не удалось получить временный доступ к файлу

# persistent_access_failed
source: Failed to get persistent access
ru: Не удалось получить постоянный доступ

source: Bookmark save error
ru: Ошибка сохранения закладки

source: Bookmark load error
ru: Ошибка загрузки закладки

source: Auto access error
ru: Ошибка автоматического доступа

source: Loading archive: %@
ru: Загрузка архива: %@

# no_archive_path
source: No archive path specified
ru: Путь к архиву не указан

# unrar_output_error
source: Failed to parse unrar output
ru: Ошибка разбора вывода unrar

source: Requesting access...
ru: Запрос доступа...

# extraction_error
source: Extraction failed with error code: %d
ru: Ошибка извлечения с кодом: %d

# rar_binary_selected
source: RAR binary selected successfully
ru: RAR утилита выбрана успешно

# no_rar_binary
source: RAR binary not found
ru: RAR утилита не найдена

source: Save Archive
ru: Сохранить архив

# archive_creation_canceled
source: Archive creation cancelled
ru: Создание архива отменено

source: Creating archive...
ru: Создание архива...

# rar_restore_error
source: Failed to restore RAR binary: %@
ru: Ошибка восстановления RAR утилиты: %@

# access_request_message_format
source: The app needs access to the file %@ to work with the archive. Click "Grant Access" to provide access.
ru: Приложению нужен доступ к файлу %@ для работы с архивом. Нажмите "Предоставить доступ", чтобы продолжить.

# rar_download_site
source: Download the RAR binary from the official website: https://www.win-rar.com/download.html
ru: Скачайте бинарник RAR на официальном сайте: https://www.win-rar.com/download.html

# gatekeeper_title
source: Security Warning
ru: Предупреждение системы безопасности

# gatekeeper_general
source: macOS has blocked RAR from running.
ru: macOS заблокировал запуск RAR.

# gatekeeper_message
source: macOS has blocked RAR from running due to security settings. Path: %@ To fix this: 1. Go to System Settings → Privacy & Security 2. Under Security, click 'Allow Anyway' next to the RAR binary
ru: macOS заблокировал запуск RAR из-за настроек безопасности. Путь: %@ Чтобы исправить: 1. Перейдите в Системные настройки → Конфиденциальность и безопасность 2. В разделе 'Безопасность' нажмите 'Разрешить' рядом с RAR

source: Open Security Settings
ru: Открыть настройки безопасности

# gatekeeper_terminal_fix
source: Alternatively, you can remove the quarantine attribute in Terminal: xattr -d com.apple.quarantine "%@"
ru: Альтернативно, вы можете удалить атрибут карантина в Терминале: xattr -d com.apple.quarantine "%@"

# rar_permission_error
source: Permission error. Trying to fix...
ru: Ошибка прав доступа. Пытаюсь исправить...

# rar_permission_fix_failed
source: Failed to set executable permissions
ru: Не удалось установить права на выполнение

# rar_ready_message
source: RAR is ready to use
ru: RAR готов к использованию

# rar_execution_failed
source: RAR execution failed with code: %d
ru: Ошибка выполнения RAR, код: %d

# rar_launch_error
source: Failed to launch RAR: %@
ru: Не удалось запустить RAR: %@

# rar_access_title
source: Access Required for RAR
ru: Предоставьте доступ к RAR

# rar_access_message
source: Please grant access to the RAR binary in the system dialog
ru: Предоставьте доступ к бинарнику RAR в системном диалоге

source: Grant Access
ru: Предоставить доступ

# rar_access_denied
source: Access to RAR was denied
ru: Доступ к RAR запрещен

# rar_activation_failed
source: Failed to activate RAR
ru: Не удалось активировать RAR

# rar_gatekeeper_activated
source: Gatekeeper activated. Please check Security settings
ru: Gatekeeper активирован. Проверьте настройки безопасности

source: Activating RAR...
ru: Активация RAR...

# gatekeeper_activated
source: Gatekeeper activated. Please check Security settings
ru: Активация Gatekeeper выполнена успешно!

# gatekeeper_activation_success
source: RAR has been successfully activated in macOS security system.
ru: RAR успешно активирован в системе безопасности macOS.

# gatekeeper_instructions
source: To complete the setup:
ru: Для завершения настройки:

# gatekeeper_step1
source: Open System Settings → Privacy & Security
ru: Откройте Системные настройки → Конфиденциальность и безопасность

# gatekeeper_step2
source: Scroll down to the Security section
ru: Прокрутите вниз до раздела Безопасность

# gatekeeper_step3
source: Click 'Allow Anyway' next to RAR
ru: Нажмите 'Разрешить всё равно' рядом с RAR

source: I've fixed it
ru: Я исправил

# rar_access_message_format
source: To use RAR functionality, please grant access to the file: %@
ru: Для использования функционала RAR предоставьте доступ к файлу: %@

# gatekeeper_false_positive
source: If you have already allowed this application to run, but you see this message, please: 1. Try to force the Gatekeeper dialog with the button below 2. Check the settings manually
ru: Если вы уже разрешили запуск этого приложения, но видите это сообщение, пожалуйста: 1. Попробуйте принудительно вызвать диалог Gatekeeper кнопкой ниже 2. Проверьте настройки вручную

# gatekeeper_step4
source: If the application is already in the list of allowed, remove it and add it again
ru: Если приложение уже есть в списке разрешенных, удалите его и добавьте снова

# trigger_gatekeeper
source: Invoke the Gatekeeper dialog
ru: Вызвать диалог Gatekeeper

# rar_already_allowed
source: RAR is already allowed in the security settings
ru: RAR уже разрешен в настройках безопасности

# archive_created_success
source: Archive created successfully!
ru: Архив успешно создан!

source: Closing...
ru: Закрывается...
